'''Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями). Выдать без повторений в порядке возрастания все те числа,
которые встречаются в обоих наборах.
Пользователь вводит 2 числа. n — кол-во элементов первого множества. m — кол-во элементов второго множества. Затем пользователь вводит 
сами элементы множеств.'''

from random import randint


print('Task 22')
n = int(input('Введите количество элементов первого множества: '))
list1 = [randint(-20, 21) for i in range(n)]
print(list1)
m = int(input('Введите количество элементов второго множества: '))
list2 = [randint(-20, 21) for i in range(m)]
print(list2)
result = set(list1) & set(list2)
if result != set():
    print(f'Result: {result} ')
else:
    print('Нет общих элементов')


'''Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растёт на круглой грядке, причём кусты высажены только по окружности.
Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растёт N кустов.
Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод — на i-ом кусте выросло ai ягод.
В этом фермерском хозяйстве внедрена система автоматического сбора черники. Эта система состоит из управляющего модуля и нескольких собирающих 
модулей. Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.
Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий модуль, находясь перед некоторым кустом 
заданной во входном файле грядки.'''